---
kind: method
id: M:Autodesk.Revit.DB.ExportFontKey.#ctor(System.String)
source: html/83ff5239-509d-7588-3a02-6bf97ffa3df8.htm
---
# Autodesk.Revit.DB.ExportFontKey.#ctor Method

Constructs a new ExportFontKey using an input font name.

## Syntax (C#)
```csharp
public ExportFontKey(
	string originalFontName
)
```

## Parameters
- **originalFontName** (`System.String`) - The original font name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null